# config.py

api_id = 20904033  # Замените на ваш фактический API ID
api_hash = '76d5b1af83337d4a2129aed1456dc2b7'  # Замените на ваш фактический API Hash
phone_number = '+84582436390'  # Ваш номер телефона, зарегистрированный в Telegram
bot_token = '6156462390:AAF87OBGof9lyTiE7UfaYhNY_tNXmg8Y7LY'  # Токен вашего бота
source_channel_id = -1001987323528  # Идентификатор исходного канала (здесь приведен пример)
destination_channel_id = -1001581194502  # Идентификатор целевого канала (здесь приведен пример)
COPY_DELAY = 1  # Задержка перед копированием файла (в секундах)
hidden_link_text = "👉 Подписаться"  # Текст скрытой ссылки
hidden_link_url = "https://t.me/expessnovosty"  # URL скрытой ссылки
LINK_TEMPLATE = "https://t.me/expessnovosty/{chat_id}/{message_id}"  # Шаблон ссылки
hidden_link_text = "👉 Подписаться"  # Текст скрытой ссылки
hidden_link_url = "https://t.me/expessnovosty"  # URL скрытой ссылки

